# 2020.11.16

# 인공지능 강의 6일차

===============================================================

In [23]:
import pandas as pd

# read excel file
titanic_df = pd.read_csv('titanic_train.csv')

## 정렬, Aggregation함수, GroupBy 적용

### DataFrame, Series의 정렬 - sort_values()

In [28]:
titanic_sorted = titanic_df.sort_values(by=['Name'])
print(titanic_sorted.head(3))

print('------------------------------------------------------------')

titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)
print(titanic_sorted.head(3))

     PassengerId  Survived  Pclass                              Name     Sex  \
845          846         0       3               Abbing, Mr. Anthony    male
746          747         0       3       Abbott, Mr. Rossmore Edward    male
279          280         1       3  Abbott, Mrs. Stanton (Rosa Hunt)  female

      Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845  42.0      0      0  C.A. 5547   7.55   NaN        S
746  16.0      1      1  C.A. 2673  20.25   NaN        S
279  35.0      1      1  C.A. 2673  20.25   NaN        S
------------------------------------------------------------
     PassengerId  Survived  Pclass                             Name   Sex  \
868          869         0       3      van Melkebeke, Mr. Philemon  male
153          154         0       3  van Billiard, Mr. Austin Blyler  male
282          283         0       3        de Pelsmaeker, Mr. Alfons  male

      Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868   NaN      0      0    345777   9.5   NaN        S
153  40.5      0      2  A/5. 851  14.5   NaN        S
282  16.0      0      0    345778   9.5   NaN        S

### Aggregation 함수 적용

In [9]:
# Missing data가 아닌 것을 센다.
print(titanic_df.count())

print('------------------------------------------------------------')

# 'Age'와 'Fare'의 평균값을 구한다.
print(titanic_df[['Age', 'Fare']].mean())

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64
------------------------------------------------------------
Age     29.699118
Fare    32.204208
dtype: float64

### groupby() 이용하기

In [17]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

print('------------------------------------------------------------')

titanic_groupby = titanic_df.groupby('Pclass').count()
print(titanic_groupby)

print('------------------------------------------------------------')

titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
print(titanic_groupby)

print('------------------------------------------------------------')

# Pclass안의 Age max값과 min값
print(titanic_df.groupby('Pclass')['Age'].agg([max, min]))

print('------------------------------------------------------------')

# 동시에 여러가지 요소로 볼 수 있다.
agg_format={'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)
# 당연히 이렇게도 사용가능하다.
titanic_df.groupby('Pclass').agg({'Age':'max', 'SibSp':'sum', 'Fare':'mean'})

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
------------------------------------------------------------
        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  \
Pclass
1               216       216   216  216  186    216    216     216   216
2               184       184   184  184  173    184    184     184   184
3               491       491   491  491  355    491    491     491   491

        Cabin  Embarked
Pclass
1         176       214
2          16       184
3          12       491
------------------------------------------------------------
        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491
------------------------------------------------------------
         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42
------------------------------------------------------------

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

===============================================================

## 결손 데이터 처리하기

### isna()로 결손 데이터 여부 확인

In [21]:
print(titanic_df.isna().head(3))

print('------------------------------------------------------------')

print(titanic_df.isna().sum())

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket  \
0        False     False   False  False  False  False  False  False   False
1        False     False   False  False  False  False  False  False   False
2        False     False   False  False  False  False  False  False   False

    Fare  Cabin  Embarked
0  False   True     False
1  False  False     False
2  False   True     False
------------------------------------------------------------
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### fillna()로 Missing 데이터 대체하기

In [29]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
print(titanic_df.head(3))


print('------------------------------------------------------------')

titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500  C000        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250  C000        S
------------------------------------------------------------

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

## apply lambda 식으로 데이터 가공

In [34]:
def get_square(a):
    return a**2

print('3의 제곱은(def 사용) :', get_square(3))

print('------------------------------------------------------------')

lambda_square = lambda x : x**2
print('3의 제곱은(lambda 사용) :', lambda_square(3))

print('------------------------------------------------------------')

a=[1,2,3]
squares = map(lambda x : x**2, a)
print(list(squares))

3의 제곱은(def 사용) : 9
------------------------------------------------------------
3의 제곱은(lambda 사용) : 9
------------------------------------------------------------
[1, 4, 9]

In [39]:
titanic_df['Name_len']= titanic_df['Name'].apply(lambda x : len(x))
print(titanic_df[['Name','Name_len']].head(3))

print('------------------------------------------------------------')

titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x <=15 else 'Adult' )
print(titanic_df[['Age','Child_Adult']].head(8))

print('------------------------------------------------------------')

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x <= 60 else 'Elderly'))
print(titanic_df['Age_cat'].value_counts())

titanic_df = titanic_df.drop(['Name_len', 'Child_Adult', 'Age_cat'], axis=1)
titanic_df.info

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22
------------------------------------------------------------
         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child
------------------------------------------------------------
Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex        Age  \
0                              Braund, Mr. Owen Harris    male  22.000000
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.000000
2                               Heikkinen, Miss. Laina  female  26.000000
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.000000
4                             Allen, Mr. William Henry    male  35.000000
..                                                 ...     ...        ...
886                              Montvila, Rev. Juozas    male  27.000000
887                       Graham, Miss. Margaret Edith  female  19.000000
888           Johnston, Miss. Catherine Helen "Carrie"  female  29.699118
889                              Behr, Mr. Karl Howell    male  26.000000
890                                Dooley, Mr. Patrick    male  32.000000

     SibSp  Parch            Ticket     Fare Cabin Embarked
0        1      0         A/5 21171   7.2500  C000        S
1        1      0          PC 17599  71.2833   C85        C
2        0      0  STON/O2. 3101282   7.9250  C000        S
3        1      0            113803  53.1000  C123        S
4        0      0            373450   8.0500  C000        S
..     ...    ...               ...      ...   ...      ...
886      0      0            211536  13.0000  C000        S
887      0      0            112053  30.0000   B42        S
888      1      2        W./C. 6607  23.4500  C000        S
889      0      0            111369  30.0000  C148        C
890      0      0            370376   7.7500  C000        Q

[891 rows x 12 columns]>

In [36]:
# 나이에 따라 세분화된 분류를 수행하는 함수 생성. 
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else : cat = 'Elderly'
    
    return cat

# lambda 식에 위에서 생성한 get_category( ) 함수를 반환값으로 지정. 
# get_category(X)는 입력값으로 ‘Age’ 컬럼 값을 받아서 해당하는 cat 반환
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age','Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult

===============================================================

## Pandas exercises

In [1]:
import pandas as pd
titanic_df = pd.read_csv('titanic_train.csv')
titanic_df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [113]:
# 1. Create a Feature that tells whether a passenger had a cabin on Titanic or not.
num1_df = titanic_df['Cabin'].isna()
print(num1_df.sum())
print(num1_df.head(3))

print('------------------------------------------------------------')

num1_df = titanic_df['Cabin'].apply(lambda x: 0 if type(x) == float else 1)
print(num1_df.head(3))

687
0     True
1    False
2     True
Name: Cabin, dtype: bool
------------------------------------------------------------
0    0
1    1
2    0
Name: Cabin, dtype: int64

In [115]:
# 2. In 'Fare' Find Null Value and fill with median value
titanic_df['Fare'] = titanic_df['Fare'].fillna(titanic_df['Fare'].median())
print(titanic_df['Fare'].isna().sum())
titanic_df['Fare']

0

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [68]:
# 3. Create a feature and find the size of Family
titanic_df['Family'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1

In [136]:
# 4. Find the Ratio of Male and Female in Dataset using Groupby Function
titanic_sex_groupby = titanic_df.groupby('Sex').count()
print(titanic_sex_groupby)

print('-------------------------------------------------')

titanic_sex_groupby = titanic_df.groupby('Sex')['Survived'].count().sort_values(ascending=False)
titanic_sex_groupby

        PassengerId  Survived  Pclass  Name  Age  SibSp  Parch  Ticket  Fare  \
Sex
female          314       314     314   314  261    314    314     314   314
male            577       577     577   577  453    577    577     577   577

        Cabin  Embarked
Sex
female     97       312
male      107       577
-------------------------------------------------

Sex
male      577
female    314
Name: Survived, dtype: int64

In [140]:
# 5. Change the (Sex) Feature into Categorical to Numerical or Ordinal
num5 = titanic_df['Sex'].apply(lambda x: 0 if x=='male' else 1)
print(num5.head(5))
print(titanic_df['Sex'].head(5))

print('-------------------------------------------------')

num5['Sex'] = titanic_df['Sex'].map({'female':0, 'male':1}).astype(int)
print(num5)

0    0
1    1
2    1
3    1
4    0
Name: Sex, dtype: int64
0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object
-------------------------------------------------
0                                                      0
1                                                      1
2                                                      1
3                                                      1
4                                                      0
                             ...
887                                                    1
888                                                    1
889                                                    0
890                                                    0
Sex    0      1
1      0
2      0
3      0
4      1
 ...
Name: Sex, Length: 892, dtype: object

In [185]:
# 6. Write a code that finds the number of males who survived and whose age is 22 years old or younger on train.csv
num6_df = titanic_df[(titanic_df['Survived']==1) & (titanic_df['Sex'] == 'male') & (titanic_df['Age'] < 23)]
num6_df.head(3)
   
num6_df['Survived'].sum()

print('-------------------------------------------')

# 오 신기하다.
adults = titanic_df[titanic_df.Age <= 22.0][titanic_df.Survived == 1][titanic_df.Sex == 'male']
adults.Survived.sum()

-------------------------------------------

<ipython-input-185-fee60c5b3b3d>:10: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  adults = titanic_df[titanic_df.Age <= 22.0][titanic_df.Survived == 1][titanic_df.Sex == 'male']

31

In [10]:
# 7. Write a code that finds how much was the average fare for 1st passenger class (Pclass) 
num7_df = titanic_df[titanic_df['Pclass'] == 1]
num7_df = num7_df.groupby('Pclass').agg({'Fare':'mean'})
tmp = num7_df.to_string(index=False, header=False)
print(tmp)

 84.154687

In [5]:
#  8. Write a code that categories Embarked places and finds min, max, mean and count of Fare (Using groupBy()) Embarked: Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)
num8_df = titanic_df.groupby('Embarked')['Fare'].agg(['count', 'min', 'max', 'mean'])
num8_df

          count     min       max       mean
Embarked
C           168  4.0125  512.3292  59.954144
Q            77  6.7500   90.0000  13.276030
S           644  0.0000  263.0000  27.079812

In [180]:
# 9. Write a code that finds the ticket number of 'Nakid, Mr. Sahid' on train.csv 
num9_df = titanic_df[titanic_df['Name']=='Nakid, Mr. Sahid']
# 인덱스 안나오도록 설정
print(num9_df['Ticket'].to_string(index=False))
# num9_df

 2653

In [19]:
# 10. Write a code using titanic_data (made Question 5) that shows 
# (1) Percentage of children with parents who survived, 
# (2) Percentage of children without parents who survived, 
# (3) Average age of surviving children with parents, 
# (4) Average age of surviving children without parents 
# (Note: 1st, use ‘Age’ and ‘Parch’, 2nd, children means passengers under 18)

===============================================================

# 기계학습의 원리, 능력과 한계

* 지도 학습(Supervised learning) : 올바른 입력/출력 쌍으로된 훈련 데이터로부터 입출력간의 함수 학습

* 비지도 학습(Unsupervised learning) : 데이터의 무리 짓기(Clustering) or 일관된 해석의 도출

* 강화 학습(Reinforcement learning) :  계속된 행동으로 얻은 보상으로부터 올바른 행동을 학습

#### 선형 함수

 - 1) y = ax + b
 - 2) 0 = a1x1 + a2x2 + a3x3 + a4x4
 - feature : a1, a2, a3 label : a4

#### 기계 학습이 궁극적으로 추구하는 것은 패턴 인식이다.

 - underfitting
 
 - good fit
 
 - overfitting

#### 고전적 패턴인식 시스템의 설계
 - 데이터 수집
 - 특성의 선택
 - 인식 방법론의 선택과 설계
 - 훈련
 - 평가